test/site/content-org/src-blocks-with-highlight-shortcode.org
#+hugo_base_dir: ../
#+hugo_code_fence:
# Below will also do the same thing (because using
# org-hugo--plist-get-true-p instead of just plist-get).
# #+hugo_code_fence: nil
#
# Below will use Markdown code fence instead of the highlight
# shortcode.
# #+hugo_code_fence: t

#+author:

#+seq_todo: TODO DRAFT DONE

* Source blocks with Hugo =highlight= shortcode
:PROPERTIES:
:EXPORT_FILE_NAME: shortcode-src-blocks
:EXPORT_DATE: 2017-07-13T17:57:58-04:00
:END:
Here are few variables that you might like to change in the =local.mk=:
- =prefix= :: Org installation directory
 #+begin_src makefile
prefix = /dir/where/you/want/to/install/org # Default: /usr/share
#+end_src
 The =.el= files will go to =$(prefix)/emacs/site-lisp/org= by
              default. If you'd like to change that, you can tweak the
              =lispdir= variable.
- =infodir= :: Org Info installation directory. I like to keep the
                   Info file for development version of Org in a separate
                   directory.
 #+begin_src makefile
infodir = $(prefix)/org/info # Default: $(prefix)/info
#+end_src
- =ORG_MAKE_DOC= :: Types of Org documentation you'd like to build by
                    default.
 #+begin_src makefile
# Define below you only need info documentation, the default includes html and pdf
ORG_MAKE_DOC = info pdf card # html
#+end_src
- =ORG_ADD_CONTRIB= :: Packages from the =contrib/= directory that
     you'd like to build along with Org. Below are the ones on my
     /must-have/ list.
 #+begin_src makefile
# Define if you want to include some (or all) files from contrib/lisp
# just the filename please (no path prefix, no .el suffix), maybe with globbing
#   org-eldoc - Heading breadcrumb trail in minibuffer
#   ox-extra - Allow ignoring just the heading, but still export the body of those headings
#   org-mime - Convert org buffer to htmlized format for email
ORG_ADD_CONTRIB = org-eldoc ox-extra org-mime
#+end_src
